rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.4
**     Version:             rev. 1.5, 2024-08-01
**     Build:               b240801
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_FLEXCAN.h
 * @version 1.5
 * @date 2024-08-01
 * @brief Peripheral Access Layer for S32M24x_FLEXCAN
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_FLEXCAN_H_) /* Check if memory map has not been already included */
#define S32M24x_FLEXCAN_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- FLEXCAN Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXCAN_Peripheral_Access_Layer FLEXCAN Peripheral Access Layer
 * @{
 */

/** FLEXCAN - Size of Registers Arrays */
#define FLEXCAN_RAMn_COUNT 128u
#define FLEXCAN_RXIMR_COUNT 64u
#define FLEXCAN_WMB_COUNT 4u

/** FLEXCAN - Register Layout Typedef */
typedef struct {
    __IO uint32_t MCR;   /**< Module Configuration Register, offset: 0x0 */
    __IO uint32_t CTRL1; /**< Control 1 Register, offset: 0x4 */
    __IO uint32_t TIMER; /**< Free Running Timer, offset: 0x8 */
    uint8_t RESERVED_0[4];
    __IO uint32_t RXMGMASK; /**< Rx Mailboxes Global Mask Register, offset: 0x10 */
    __IO uint32_t RX14MASK; /**< Rx 14 Mask Register, offset: 0x14 */
    __IO uint32_t RX15MASK; /**< Rx 15 Mask Register, offset: 0x18 */
    __IO uint32_t ECR;      /**< Error Counter, offset: 0x1C */
    __IO uint32_t ESR1;     /**< Error and Status 1 Register, offset: 0x20 */
    __IO uint32_t IMASK2;   /**< Interrupt Masks 2 Register, offset: 0x24 */
    __IO uint32_t IMASK1;   /**< Interrupt Masks 1 Register, offset: 0x28 */
    __IO uint32_t IFLAG2;   /**< Interrupt Flags 2 Register, offset: 0x2C */
    __IO uint32_t IFLAG1;   /**< Interrupt Flags 1 Register, offset: 0x30 */
    __IO uint32_t CTRL2;    /**< Control 2 Register, offset: 0x34 */
    __I uint32_t ESR2;      /**< Error and Status 2 Register, offset: 0x38 */
    uint8_t RESERVED_1[8];
    __I uint32_t CRCR;      /**< CRC Register, offset: 0x44 */
    __IO uint32_t RXFGMASK; /**< Rx FIFO Global Mask Register, offset: 0x48 */
    __I uint32_t RXFIR;     /**< Rx FIFO Information Register, offset: 0x4C */
    __IO uint32_t CBT;      /**< CAN Bit Timing Register, offset: 0x50 */
    uint8_t RESERVED_2[44];
    __IO uint32_t
        RAMn[FLEXCAN_RAMn_COUNT]; /**< Embedded RAM, array offset: 0x80, array step: 0x4 */
    uint8_t RESERVED_3[1536];
    __IO uint32_t RXIMR[FLEXCAN_RXIMR_COUNT]; /**< Rx Individual Mask Registers, array offset:
                                                 0x880, array step: 0x4 */
    uint8_t RESERVED_4[384];
    __IO uint32_t CTRL1_PN; /**< Pretended Networking Control 1 Register, offset: 0xB00 */
    __IO uint32_t CTRL2_PN; /**< Pretended Networking Control 2 Register, offset: 0xB04 */
    __IO uint32_t WU_MTC;   /**< Pretended Networking Wake Up Match Register, offset: 0xB08 */
    __IO uint32_t FLT_ID1;  /**< Pretended Networking ID Filter 1 Register, offset: 0xB0C */
    __IO uint32_t FLT_DLC;  /**< Pretended Networking DLC Filter Register, offset: 0xB10 */
    __IO uint32_t PL1_LO; /**< Pretended Networking Payload Low Filter 1 Register, offset: 0xB14 */
    __IO uint32_t PL1_HI; /**< Pretended Networking Payload High Filter 1 Register, offset: 0xB18 */
    __IO uint32_t FLT_ID2_IDMASK; /**< Pretended Networking ID Filter 2 Register / ID Mask Register,
                                     offset: 0xB1C */
    __IO uint32_t PL2_PLMASK_LO;  /**< Pretended Networking Payload Low Filter 2 Register / Payload
                                     Low Mask register, offset: 0xB20 */
    __IO uint32_t PL2_PLMASK_HI;  /**< Pretended Networking Payload High Filter 2 low order bits /
                                     Payload High Mask register, offset: 0xB24 */
    uint8_t RESERVED_5[24];
    struct FLEXCAN_WMB {       /* offset: 0xB40, array step: 0x10 */
        __I uint32_t WMBn_CS;  /**< Wake Up Message Buffer register for C/S, array offset: 0xB40,
                                  array step: 0x10 */
        __I uint32_t WMBn_ID;  /**< Wake Up Message Buffer Register for ID, array offset: 0xB44,
                                  array step: 0x10 */
        __I uint32_t WMBn_D03; /**< Wake Up Message Buffer Register for Data 0-3, array offset:
                                  0xB48, array step: 0x10 */
        __I uint32_t WMBn_D47; /**< Wake Up Message Buffer Register Data 4-7, array offset: 0xB4C,
                                  array step: 0x10 */
    } WMB[FLEXCAN_WMB_COUNT];
    uint8_t RESERVED_6[128];
    __IO uint32_t FDCTRL; /**< CAN FD Control Register, offset: 0xC00 */
    __IO uint32_t FDCBT;  /**< CAN FD Bit Timing Register, offset: 0xC04 */
    __I uint32_t FDCRC;   /**< CAN FD CRC Register, offset: 0xC08 */
} FLEXCAN_Type, *FLEXCAN_MemMapPtr;

