rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
/** Number of instances of the FLEXCAN module. */
#define FLEXCAN_INSTANCE_COUNT (1u)

/* FLEXCAN - Peripheral instance base addresses */
/** Peripheral FLEXCAN0 base address */
#define IP_FLEXCAN0_BASE (0x40024000u)
/** Peripheral FLEXCAN0 base pointer */
#define IP_FLEXCAN0 ((FLEXCAN_Type*)IP_FLEXCAN0_BASE)
/** Array initializer of FLEXCAN peripheral base addresses */
#define IP_FLEXCAN_BASE_ADDRS                                                                      \
    {                                                                                              \
        IP_FLEXCAN0_BASE                                                                           \
    }
/** Array initializer of FLEXCAN peripheral base pointers */
#define IP_FLEXCAN_BASE_PTRS                                                                       \
    {                                                                                              \
        IP_FLEXCAN0                                                                                \
    }

/* ----------------------------------------------------------------------------
   -- FLEXCAN Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXCAN_Register_Masks FLEXCAN Register Masks
 * @{
 */

/*! @name MCR - Module Configuration Register */
/*! @{ */

#define FLEXCAN_MCR_MAXMB_MASK (0x7FU)
#define FLEXCAN_MCR_MAXMB_SHIFT (0U)
#define FLEXCAN_MCR_MAXMB_WIDTH (7U)
#define FLEXCAN_MCR_MAXMB(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_MAXMB_SHIFT)) & FLEXCAN_MCR_MAXMB_MASK)

#define FLEXCAN_MCR_IDAM_MASK (0x300U)
#define FLEXCAN_MCR_IDAM_SHIFT (8U)
#define FLEXCAN_MCR_IDAM_WIDTH (2U)
#define FLEXCAN_MCR_IDAM(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_IDAM_SHIFT)) & FLEXCAN_MCR_IDAM_MASK)

#define FLEXCAN_MCR_FDEN_MASK (0x800U)
#define FLEXCAN_MCR_FDEN_SHIFT (11U)
#define FLEXCAN_MCR_FDEN_WIDTH (1U)
#define FLEXCAN_MCR_FDEN(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_FDEN_SHIFT)) & FLEXCAN_MCR_FDEN_MASK)

#define FLEXCAN_MCR_AEN_MASK (0x1000U)
#define FLEXCAN_MCR_AEN_SHIFT (12U)
#define FLEXCAN_MCR_AEN_WIDTH (1U)
#define FLEXCAN_MCR_AEN(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_AEN_SHIFT)) & FLEXCAN_MCR_AEN_MASK)

#define FLEXCAN_MCR_LPRIOEN_MASK (0x2000U)
#define FLEXCAN_MCR_LPRIOEN_SHIFT (13U)
#define FLEXCAN_MCR_LPRIOEN_WIDTH (1U)
#define FLEXCAN_MCR_LPRIOEN(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_LPRIOEN_SHIFT)) & FLEXCAN_MCR_LPRIOEN_MASK)

#define FLEXCAN_MCR_PNET_EN_MASK (0x4000U)
#define FLEXCAN_MCR_PNET_EN_SHIFT (14U)
#define FLEXCAN_MCR_PNET_EN_WIDTH (1U)
#define FLEXCAN_MCR_PNET_EN(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_PNET_EN_SHIFT)) & FLEXCAN_MCR_PNET_EN_MASK)

#define FLEXCAN_MCR_DMA_MASK (0x8000U)
#define FLEXCAN_MCR_DMA_SHIFT (15U)
#define FLEXCAN_MCR_DMA_WIDTH (1U)
#define FLEXCAN_MCR_DMA(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_DMA_SHIFT)) & FLEXCAN_MCR_DMA_MASK)

#define FLEXCAN_MCR_IRMQ_MASK (0x10000U)
#define FLEXCAN_MCR_IRMQ_SHIFT (16U)
#define FLEXCAN_MCR_IRMQ_WIDTH (1U)
#define FLEXCAN_MCR_IRMQ(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_IRMQ_SHIFT)) & FLEXCAN_MCR_IRMQ_MASK)

#define FLEXCAN_MCR_SRXDIS_MASK (0x20000U)
#define FLEXCAN_MCR_SRXDIS_SHIFT (17U)
#define FLEXCAN_MCR_SRXDIS_WIDTH (1U)
#define FLEXCAN_MCR_SRXDIS(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_SRXDIS_SHIFT)) & FLEXCAN_MCR_SRXDIS_MASK)

#define FLEXCAN_MCR_LPMACK_MASK (0x100000U)
#define FLEXCAN_MCR_LPMACK_SHIFT (20U)
#define FLEXCAN_MCR_LPMACK_WIDTH (1U)
#define FLEXCAN_MCR_LPMACK(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_LPMACK_SHIFT)) & FLEXCAN_MCR_LPMACK_MASK)

#define FLEXCAN_MCR_WRNEN_MASK (0x200000U)
#define FLEXCAN_MCR_WRNEN_SHIFT (21U)
#define FLEXCAN_MCR_WRNEN_WIDTH (1U)
#define FLEXCAN_MCR_WRNEN(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_WRNEN_SHIFT)) & FLEXCAN_MCR_WRNEN_MASK)

#define FLEXCAN_MCR_SUPV_MASK (0x800000U)
#define FLEXCAN_MCR_SUPV_SHIFT (23U)
#define FLEXCAN_MCR_SUPV_WIDTH (1U)
#define FLEXCAN_MCR_SUPV(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_SUPV_SHIFT)) & FLEXCAN_MCR_SUPV_MASK)

#define FLEXCAN_MCR_FRZACK_MASK (0x1000000U)
#define FLEXCAN_MCR_FRZACK_SHIFT (24U)
#define FLEXCAN_MCR_FRZACK_WIDTH (1U)
#define FLEXCAN_MCR_FRZACK(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_FRZACK_SHIFT)) & FLEXCAN_MCR_FRZACK_MASK)

#define FLEXCAN_MCR_SOFTRST_MASK (0x2000000U)
#define FLEXCAN_MCR_SOFTRST_SHIFT (25U)
#define FLEXCAN_MCR_SOFTRST_WIDTH (1U)
#define FLEXCAN_MCR_SOFTRST(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_SOFTRST_SHIFT)) & FLEXCAN_MCR_SOFTRST_MASK)

#define FLEXCAN_MCR_NOTRDY_MASK (0x8000000U)
#define FLEXCAN_MCR_NOTRDY_SHIFT (27U)
#define FLEXCAN_MCR_NOTRDY_WIDTH (1U)
#define FLEXCAN_MCR_NOTRDY(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_NOTRDY_SHIFT)) & FLEXCAN_MCR_NOTRDY_MASK)

#define FLEXCAN_MCR_HALT_MASK (0x10000000U)
#define FLEXCAN_MCR_HALT_SHIFT (28U)
#define FLEXCAN_MCR_HALT_WIDTH (1U)
#define FLEXCAN_MCR_HALT(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_HALT_SHIFT)) & FLEXCAN_MCR_HALT_MASK)

#define FLEXCAN_MCR_RFEN_MASK (0x20000000U)
#define FLEXCAN_MCR_RFEN_SHIFT (29U)
#define FLEXCAN_MCR_RFEN_WIDTH (1U)
#define FLEXCAN_MCR_RFEN(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_RFEN_SHIFT)) & FLEXCAN_MCR_RFEN_MASK)

#define FLEXCAN_MCR_FRZ_MASK (0x40000000U)
#define FLEXCAN_MCR_FRZ_SHIFT (30U)
#define FLEXCAN_MCR_FRZ_WIDTH (1U)
#define FLEXCAN_MCR_FRZ(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_FRZ_SHIFT)) & FLEXCAN_MCR_FRZ_MASK)

#define FLEXCAN_MCR_MDIS_MASK (0x80000000U)
#define FLEXCAN_MCR_MDIS_SHIFT (31U)
#define FLEXCAN_MCR_MDIS_WIDTH (1U)
#define FLEXCAN_MCR_MDIS(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_MDIS_SHIFT)) & FLEXCAN_MCR_MDIS_MASK)
/*! @} */

/*! @name CTRL1 - Control 1 Register */
/*! @{ */

