rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
#define FLEXCAN_CTRL1_PROPSEG_MASK (0x7U)
#define FLEXCAN_CTRL1_PROPSEG_SHIFT (0U)
#define FLEXCAN_CTRL1_PROPSEG_WIDTH (3U)
#define FLEXCAN_CTRL1_PROPSEG(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PROPSEG_SHIFT)) & FLEXCAN_CTRL1_PROPSEG_MASK)

#define FLEXCAN_CTRL1_LOM_MASK (0x8U)
#define FLEXCAN_CTRL1_LOM_SHIFT (3U)
#define FLEXCAN_CTRL1_LOM_WIDTH (1U)
#define FLEXCAN_CTRL1_LOM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_LOM_SHIFT)) & FLEXCAN_CTRL1_LOM_MASK)

#define FLEXCAN_CTRL1_LBUF_MASK (0x10U)
#define FLEXCAN_CTRL1_LBUF_SHIFT (4U)
#define FLEXCAN_CTRL1_LBUF_WIDTH (1U)
#define FLEXCAN_CTRL1_LBUF(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_LBUF_SHIFT)) & FLEXCAN_CTRL1_LBUF_MASK)

#define FLEXCAN_CTRL1_TSYN_MASK (0x20U)
#define FLEXCAN_CTRL1_TSYN_SHIFT (5U)
#define FLEXCAN_CTRL1_TSYN_WIDTH (1U)
#define FLEXCAN_CTRL1_TSYN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_TSYN_SHIFT)) & FLEXCAN_CTRL1_TSYN_MASK)

#define FLEXCAN_CTRL1_BOFFREC_MASK (0x40U)
#define FLEXCAN_CTRL1_BOFFREC_SHIFT (6U)
#define FLEXCAN_CTRL1_BOFFREC_WIDTH (1U)
#define FLEXCAN_CTRL1_BOFFREC(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_BOFFREC_SHIFT)) & FLEXCAN_CTRL1_BOFFREC_MASK)

#define FLEXCAN_CTRL1_SMP_MASK (0x80U)
#define FLEXCAN_CTRL1_SMP_SHIFT (7U)
#define FLEXCAN_CTRL1_SMP_WIDTH (1U)
#define FLEXCAN_CTRL1_SMP(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_SMP_SHIFT)) & FLEXCAN_CTRL1_SMP_MASK)

#define FLEXCAN_CTRL1_RWRNMSK_MASK (0x400U)
#define FLEXCAN_CTRL1_RWRNMSK_SHIFT (10U)
#define FLEXCAN_CTRL1_RWRNMSK_WIDTH (1U)
#define FLEXCAN_CTRL1_RWRNMSK(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_RWRNMSK_SHIFT)) & FLEXCAN_CTRL1_RWRNMSK_MASK)

#define FLEXCAN_CTRL1_TWRNMSK_MASK (0x800U)
#define FLEXCAN_CTRL1_TWRNMSK_SHIFT (11U)
#define FLEXCAN_CTRL1_TWRNMSK_WIDTH (1U)
#define FLEXCAN_CTRL1_TWRNMSK(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_TWRNMSK_SHIFT)) & FLEXCAN_CTRL1_TWRNMSK_MASK)

#define FLEXCAN_CTRL1_LPB_MASK (0x1000U)
#define FLEXCAN_CTRL1_LPB_SHIFT (12U)
#define FLEXCAN_CTRL1_LPB_WIDTH (1U)
#define FLEXCAN_CTRL1_LPB(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_LPB_SHIFT)) & FLEXCAN_CTRL1_LPB_MASK)

#define FLEXCAN_CTRL1_CLKSRC_MASK (0x2000U)
#define FLEXCAN_CTRL1_CLKSRC_SHIFT (13U)
#define FLEXCAN_CTRL1_CLKSRC_WIDTH (1U)
#define FLEXCAN_CTRL1_CLKSRC(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_CLKSRC_SHIFT)) & FLEXCAN_CTRL1_CLKSRC_MASK)

#define FLEXCAN_CTRL1_ERRMSK_MASK (0x4000U)
#define FLEXCAN_CTRL1_ERRMSK_SHIFT (14U)
#define FLEXCAN_CTRL1_ERRMSK_WIDTH (1U)
#define FLEXCAN_CTRL1_ERRMSK(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_ERRMSK_SHIFT)) & FLEXCAN_CTRL1_ERRMSK_MASK)

#define FLEXCAN_CTRL1_BOFFMSK_MASK (0x8000U)
#define FLEXCAN_CTRL1_BOFFMSK_SHIFT (15U)
#define FLEXCAN_CTRL1_BOFFMSK_WIDTH (1U)
#define FLEXCAN_CTRL1_BOFFMSK(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_BOFFMSK_SHIFT)) & FLEXCAN_CTRL1_BOFFMSK_MASK)

#define FLEXCAN_CTRL1_PSEG2_MASK (0x70000U)
#define FLEXCAN_CTRL1_PSEG2_SHIFT (16U)
#define FLEXCAN_CTRL1_PSEG2_WIDTH (3U)
#define FLEXCAN_CTRL1_PSEG2(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PSEG2_SHIFT)) & FLEXCAN_CTRL1_PSEG2_MASK)

#define FLEXCAN_CTRL1_PSEG1_MASK (0x380000U)
#define FLEXCAN_CTRL1_PSEG1_SHIFT (19U)
#define FLEXCAN_CTRL1_PSEG1_WIDTH (3U)
#define FLEXCAN_CTRL1_PSEG1(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PSEG1_SHIFT)) & FLEXCAN_CTRL1_PSEG1_MASK)

#define FLEXCAN_CTRL1_RJW_MASK (0xC00000U)
#define FLEXCAN_CTRL1_RJW_SHIFT (22U)
#define FLEXCAN_CTRL1_RJW_WIDTH (2U)
#define FLEXCAN_CTRL1_RJW(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_RJW_SHIFT)) & FLEXCAN_CTRL1_RJW_MASK)

#define FLEXCAN_CTRL1_PRESDIV_MASK (0xFF000000U)
#define FLEXCAN_CTRL1_PRESDIV_SHIFT (24U)
#define FLEXCAN_CTRL1_PRESDIV_WIDTH (8U)
#define FLEXCAN_CTRL1_PRESDIV(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PRESDIV_SHIFT)) & FLEXCAN_CTRL1_PRESDIV_MASK)
/*! @} */

/*! @name TIMER - Free Running Timer */
/*! @{ */

#define FLEXCAN_TIMER_TIMER_MASK (0xFFFFU)
#define FLEXCAN_TIMER_TIMER_SHIFT (0U)
#define FLEXCAN_TIMER_TIMER_WIDTH (16U)
#define FLEXCAN_TIMER_TIMER(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_TIMER_TIMER_SHIFT)) & FLEXCAN_TIMER_TIMER_MASK)
/*! @} */

/*! @name RXMGMASK - Rx Mailboxes Global Mask Register */
/*! @{ */

#define FLEXCAN_RXMGMASK_MG_MASK (0xFFFFFFFFU)
#define FLEXCAN_RXMGMASK_MG_SHIFT (0U)
#define FLEXCAN_RXMGMASK_MG_WIDTH (32U)
#define FLEXCAN_RXMGMASK_MG(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RXMGMASK_MG_SHIFT)) & FLEXCAN_RXMGMASK_MG_MASK)
/*! @} */

/*! @name RX14MASK - Rx 14 Mask Register */
/*! @{ */

#define FLEXCAN_RX14MASK_RX14M_MASK (0xFFFFFFFFU)
#define FLEXCAN_RX14MASK_RX14M_SHIFT (0U)
#define FLEXCAN_RX14MASK_RX14M_WIDTH (32U)
#define FLEXCAN_RX14MASK_RX14M(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RX14MASK_RX14M_SHIFT)) & FLEXCAN_RX14MASK_RX14M_MASK)
/*! @} */

/*! @name RX15MASK - Rx 15 Mask Register */
/*! @{ */

#define FLEXCAN_RX15MASK_RX15M_MASK (0xFFFFFFFFU)
#define FLEXCAN_RX15MASK_RX15M_SHIFT (0U)
#define FLEXCAN_RX15MASK_RX15M_WIDTH (32U)
#define FLEXCAN_RX15MASK_RX15M(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RX15MASK_RX15M_SHIFT)) & FLEXCAN_RX15MASK_RX15M_MASK)
/*! @} */

/*! @name ECR - Error Counter */
/*! @{ */

#define FLEXCAN_ECR_TXERRCNT_MASK (0xFFU)
#define FLEXCAN_ECR_TXERRCNT_SHIFT (0U)
#define FLEXCAN_ECR_TXERRCNT_WIDTH (8U)
#define FLEXCAN_ECR_TXERRCNT(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ECR_TXERRCNT_SHIFT)) & FLEXCAN_ECR_TXERRCNT_MASK)

