rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
#define FLEXCAN_ECR_RXERRCNT_MASK (0xFF00U)
#define FLEXCAN_ECR_RXERRCNT_SHIFT (8U)
#define FLEXCAN_ECR_RXERRCNT_WIDTH (8U)
#define FLEXCAN_ECR_RXERRCNT(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ECR_RXERRCNT_SHIFT)) & FLEXCAN_ECR_RXERRCNT_MASK)

#define FLEXCAN_ECR_TXERRCNT_FAST_MASK (0xFF0000U)
#define FLEXCAN_ECR_TXERRCNT_FAST_SHIFT (16U)
#define FLEXCAN_ECR_TXERRCNT_FAST_WIDTH (8U)
#define FLEXCAN_ECR_TXERRCNT_FAST(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ECR_TXERRCNT_FAST_SHIFT)) &                            \
     FLEXCAN_ECR_TXERRCNT_FAST_MASK)

#define FLEXCAN_ECR_RXERRCNT_FAST_MASK (0xFF000000U)
#define FLEXCAN_ECR_RXERRCNT_FAST_SHIFT (24U)
#define FLEXCAN_ECR_RXERRCNT_FAST_WIDTH (8U)
#define FLEXCAN_ECR_RXERRCNT_FAST(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ECR_RXERRCNT_FAST_SHIFT)) &                            \
     FLEXCAN_ECR_RXERRCNT_FAST_MASK)
/*! @} */

/*! @name ESR1 - Error and Status 1 Register */
/*! @{ */

#define FLEXCAN_ESR1_ERRINT_MASK (0x2U)
#define FLEXCAN_ESR1_ERRINT_SHIFT (1U)
#define FLEXCAN_ESR1_ERRINT_WIDTH (1U)
#define FLEXCAN_ESR1_ERRINT(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_ERRINT_SHIFT)) & FLEXCAN_ESR1_ERRINT_MASK)

#define FLEXCAN_ESR1_BOFFINT_MASK (0x4U)
#define FLEXCAN_ESR1_BOFFINT_SHIFT (2U)
#define FLEXCAN_ESR1_BOFFINT_WIDTH (1U)
#define FLEXCAN_ESR1_BOFFINT(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BOFFINT_SHIFT)) & FLEXCAN_ESR1_BOFFINT_MASK)

#define FLEXCAN_ESR1_RX_MASK (0x8U)
#define FLEXCAN_ESR1_RX_SHIFT (3U)
#define FLEXCAN_ESR1_RX_WIDTH (1U)
#define FLEXCAN_ESR1_RX(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_RX_SHIFT)) & FLEXCAN_ESR1_RX_MASK)

#define FLEXCAN_ESR1_FLTCONF_MASK (0x30U)
#define FLEXCAN_ESR1_FLTCONF_SHIFT (4U)
#define FLEXCAN_ESR1_FLTCONF_WIDTH (2U)
#define FLEXCAN_ESR1_FLTCONF(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_FLTCONF_SHIFT)) & FLEXCAN_ESR1_FLTCONF_MASK)

#define FLEXCAN_ESR1_TX_MASK (0x40U)
#define FLEXCAN_ESR1_TX_SHIFT (6U)
#define FLEXCAN_ESR1_TX_WIDTH (1U)
#define FLEXCAN_ESR1_TX(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_TX_SHIFT)) & FLEXCAN_ESR1_TX_MASK)

#define FLEXCAN_ESR1_IDLE_MASK (0x80U)
#define FLEXCAN_ESR1_IDLE_SHIFT (7U)
#define FLEXCAN_ESR1_IDLE_WIDTH (1U)
#define FLEXCAN_ESR1_IDLE(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_IDLE_SHIFT)) & FLEXCAN_ESR1_IDLE_MASK)

#define FLEXCAN_ESR1_RXWRN_MASK (0x100U)
#define FLEXCAN_ESR1_RXWRN_SHIFT (8U)
#define FLEXCAN_ESR1_RXWRN_WIDTH (1U)
#define FLEXCAN_ESR1_RXWRN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_RXWRN_SHIFT)) & FLEXCAN_ESR1_RXWRN_MASK)

#define FLEXCAN_ESR1_TXWRN_MASK (0x200U)
#define FLEXCAN_ESR1_TXWRN_SHIFT (9U)
#define FLEXCAN_ESR1_TXWRN_WIDTH (1U)
#define FLEXCAN_ESR1_TXWRN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_TXWRN_SHIFT)) & FLEXCAN_ESR1_TXWRN_MASK)

#define FLEXCAN_ESR1_STFERR_MASK (0x400U)
#define FLEXCAN_ESR1_STFERR_SHIFT (10U)
#define FLEXCAN_ESR1_STFERR_WIDTH (1U)
#define FLEXCAN_ESR1_STFERR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_STFERR_SHIFT)) & FLEXCAN_ESR1_STFERR_MASK)

#define FLEXCAN_ESR1_FRMERR_MASK (0x800U)
#define FLEXCAN_ESR1_FRMERR_SHIFT (11U)
#define FLEXCAN_ESR1_FRMERR_WIDTH (1U)
#define FLEXCAN_ESR1_FRMERR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_FRMERR_SHIFT)) & FLEXCAN_ESR1_FRMERR_MASK)

#define FLEXCAN_ESR1_CRCERR_MASK (0x1000U)
#define FLEXCAN_ESR1_CRCERR_SHIFT (12U)
#define FLEXCAN_ESR1_CRCERR_WIDTH (1U)
#define FLEXCAN_ESR1_CRCERR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_CRCERR_SHIFT)) & FLEXCAN_ESR1_CRCERR_MASK)

#define FLEXCAN_ESR1_ACKERR_MASK (0x2000U)
#define FLEXCAN_ESR1_ACKERR_SHIFT (13U)
#define FLEXCAN_ESR1_ACKERR_WIDTH (1U)
#define FLEXCAN_ESR1_ACKERR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_ACKERR_SHIFT)) & FLEXCAN_ESR1_ACKERR_MASK)

#define FLEXCAN_ESR1_BIT0ERR_MASK (0x4000U)
#define FLEXCAN_ESR1_BIT0ERR_SHIFT (14U)
#define FLEXCAN_ESR1_BIT0ERR_WIDTH (1U)
#define FLEXCAN_ESR1_BIT0ERR(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BIT0ERR_SHIFT)) & FLEXCAN_ESR1_BIT0ERR_MASK)

#define FLEXCAN_ESR1_BIT1ERR_MASK (0x8000U)
#define FLEXCAN_ESR1_BIT1ERR_SHIFT (15U)
#define FLEXCAN_ESR1_BIT1ERR_WIDTH (1U)
#define FLEXCAN_ESR1_BIT1ERR(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BIT1ERR_SHIFT)) & FLEXCAN_ESR1_BIT1ERR_MASK)

#define FLEXCAN_ESR1_RWRNINT_MASK (0x10000U)
#define FLEXCAN_ESR1_RWRNINT_SHIFT (16U)
#define FLEXCAN_ESR1_RWRNINT_WIDTH (1U)
#define FLEXCAN_ESR1_RWRNINT(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_RWRNINT_SHIFT)) & FLEXCAN_ESR1_RWRNINT_MASK)

#define FLEXCAN_ESR1_TWRNINT_MASK (0x20000U)
#define FLEXCAN_ESR1_TWRNINT_SHIFT (17U)
#define FLEXCAN_ESR1_TWRNINT_WIDTH (1U)
#define FLEXCAN_ESR1_TWRNINT(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_TWRNINT_SHIFT)) & FLEXCAN_ESR1_TWRNINT_MASK)

#define FLEXCAN_ESR1_SYNCH_MASK (0x40000U)
#define FLEXCAN_ESR1_SYNCH_SHIFT (18U)
#define FLEXCAN_ESR1_SYNCH_WIDTH (1U)
#define FLEXCAN_ESR1_SYNCH(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_SYNCH_SHIFT)) & FLEXCAN_ESR1_SYNCH_MASK)

#define FLEXCAN_ESR1_BOFFDONEINT_MASK (0x80000U)
#define FLEXCAN_ESR1_BOFFDONEINT_SHIFT (19U)
#define FLEXCAN_ESR1_BOFFDONEINT_WIDTH (1U)
#define FLEXCAN_ESR1_BOFFDONEINT(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BOFFDONEINT_SHIFT)) &                             \
     FLEXCAN_ESR1_BOFFDONEINT_MASK)

#define FLEXCAN_ESR1_ERRINT_FAST_MASK (0x100000U)
#define FLEXCAN_ESR1_ERRINT_FAST_SHIFT (20U)
#define FLEXCAN_ESR1_ERRINT_FAST_WIDTH (1U)
#define FLEXCAN_ESR1_ERRINT_FAST(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_ERRINT_FAST_SHIFT)) &                             \
     FLEXCAN_ESR1_ERRINT_FAST_MASK)

