rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
#define FLEXCAN_ESR1_ERROVR_MASK (0x200000U)
#define FLEXCAN_ESR1_ERROVR_SHIFT (21U)
#define FLEXCAN_ESR1_ERROVR_WIDTH (1U)
#define FLEXCAN_ESR1_ERROVR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_ERROVR_SHIFT)) & FLEXCAN_ESR1_ERROVR_MASK)

#define FLEXCAN_ESR1_STFERR_FAST_MASK (0x4000000U)
#define FLEXCAN_ESR1_STFERR_FAST_SHIFT (26U)
#define FLEXCAN_ESR1_STFERR_FAST_WIDTH (1U)
#define FLEXCAN_ESR1_STFERR_FAST(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_STFERR_FAST_SHIFT)) &                             \
     FLEXCAN_ESR1_STFERR_FAST_MASK)

#define FLEXCAN_ESR1_FRMERR_FAST_MASK (0x8000000U)
#define FLEXCAN_ESR1_FRMERR_FAST_SHIFT (27U)
#define FLEXCAN_ESR1_FRMERR_FAST_WIDTH (1U)
#define FLEXCAN_ESR1_FRMERR_FAST(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_FRMERR_FAST_SHIFT)) &                             \
     FLEXCAN_ESR1_FRMERR_FAST_MASK)

#define FLEXCAN_ESR1_CRCERR_FAST_MASK (0x10000000U)
#define FLEXCAN_ESR1_CRCERR_FAST_SHIFT (28U)
#define FLEXCAN_ESR1_CRCERR_FAST_WIDTH (1U)
#define FLEXCAN_ESR1_CRCERR_FAST(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_CRCERR_FAST_SHIFT)) &                             \
     FLEXCAN_ESR1_CRCERR_FAST_MASK)

#define FLEXCAN_ESR1_BIT0ERR_FAST_MASK (0x40000000U)
#define FLEXCAN_ESR1_BIT0ERR_FAST_SHIFT (30U)
#define FLEXCAN_ESR1_BIT0ERR_FAST_WIDTH (1U)
#define FLEXCAN_ESR1_BIT0ERR_FAST(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BIT0ERR_FAST_SHIFT)) &                            \
     FLEXCAN_ESR1_BIT0ERR_FAST_MASK)

#define FLEXCAN_ESR1_BIT1ERR_FAST_MASK (0x80000000U)
#define FLEXCAN_ESR1_BIT1ERR_FAST_SHIFT (31U)
#define FLEXCAN_ESR1_BIT1ERR_FAST_WIDTH (1U)
#define FLEXCAN_ESR1_BIT1ERR_FAST(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BIT1ERR_FAST_SHIFT)) &                            \
     FLEXCAN_ESR1_BIT1ERR_FAST_MASK)
/*! @} */

/*! @name IMASK2 - Interrupt Masks 2 Register */
/*! @{ */

#define FLEXCAN_IMASK2_BUF63TO32M_MASK (0xFFFFFFFFU)
#define FLEXCAN_IMASK2_BUF63TO32M_SHIFT (0U)
#define FLEXCAN_IMASK2_BUF63TO32M_WIDTH (32U)
#define FLEXCAN_IMASK2_BUF63TO32M(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IMASK2_BUF63TO32M_SHIFT)) &                            \
     FLEXCAN_IMASK2_BUF63TO32M_MASK)
/*! @} */

/*! @name IMASK1 - Interrupt Masks 1 Register */
/*! @{ */

#define FLEXCAN_IMASK1_BUF31TO0M_MASK (0xFFFFFFFFU)
#define FLEXCAN_IMASK1_BUF31TO0M_SHIFT (0U)
#define FLEXCAN_IMASK1_BUF31TO0M_WIDTH (32U)
#define FLEXCAN_IMASK1_BUF31TO0M(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IMASK1_BUF31TO0M_SHIFT)) &                             \
     FLEXCAN_IMASK1_BUF31TO0M_MASK)
/*! @} */

/*! @name IFLAG2 - Interrupt Flags 2 Register */
/*! @{ */

#define FLEXCAN_IFLAG2_BUF63TO32I_MASK (0xFFFFFFFFU)
#define FLEXCAN_IFLAG2_BUF63TO32I_SHIFT (0U)
#define FLEXCAN_IFLAG2_BUF63TO32I_WIDTH (32U)
#define FLEXCAN_IFLAG2_BUF63TO32I(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IFLAG2_BUF63TO32I_SHIFT)) &                            \
     FLEXCAN_IFLAG2_BUF63TO32I_MASK)
/*! @} */

/*! @name IFLAG1 - Interrupt Flags 1 Register */
/*! @{ */

#define FLEXCAN_IFLAG1_BUF0I_MASK (0x1U)
#define FLEXCAN_IFLAG1_BUF0I_SHIFT (0U)
#define FLEXCAN_IFLAG1_BUF0I_WIDTH (1U)
#define FLEXCAN_IFLAG1_BUF0I(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IFLAG1_BUF0I_SHIFT)) & FLEXCAN_IFLAG1_BUF0I_MASK)

#define FLEXCAN_IFLAG1_BUF4TO1I_MASK (0x1EU)
#define FLEXCAN_IFLAG1_BUF4TO1I_SHIFT (1U)
#define FLEXCAN_IFLAG1_BUF4TO1I_WIDTH (4U)
#define FLEXCAN_IFLAG1_BUF4TO1I(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IFLAG1_BUF4TO1I_SHIFT)) & FLEXCAN_IFLAG1_BUF4TO1I_MASK)

#define FLEXCAN_IFLAG1_BUF5I_MASK (0x20U)
#define FLEXCAN_IFLAG1_BUF5I_SHIFT (5U)
#define FLEXCAN_IFLAG1_BUF5I_WIDTH (1U)
#define FLEXCAN_IFLAG1_BUF5I(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IFLAG1_BUF5I_SHIFT)) & FLEXCAN_IFLAG1_BUF5I_MASK)

#define FLEXCAN_IFLAG1_BUF6I_MASK (0x40U)
#define FLEXCAN_IFLAG1_BUF6I_SHIFT (6U)
#define FLEXCAN_IFLAG1_BUF6I_WIDTH (1U)
#define FLEXCAN_IFLAG1_BUF6I(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IFLAG1_BUF6I_SHIFT)) & FLEXCAN_IFLAG1_BUF6I_MASK)

#define FLEXCAN_IFLAG1_BUF7I_MASK (0x80U)
#define FLEXCAN_IFLAG1_BUF7I_SHIFT (7U)
#define FLEXCAN_IFLAG1_BUF7I_WIDTH (1U)
#define FLEXCAN_IFLAG1_BUF7I(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IFLAG1_BUF7I_SHIFT)) & FLEXCAN_IFLAG1_BUF7I_MASK)

#define FLEXCAN_IFLAG1_BUF31TO8I_MASK (0xFFFFFF00U)
#define FLEXCAN_IFLAG1_BUF31TO8I_SHIFT (8U)
#define FLEXCAN_IFLAG1_BUF31TO8I_WIDTH (24U)
#define FLEXCAN_IFLAG1_BUF31TO8I(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_IFLAG1_BUF31TO8I_SHIFT)) &                             \
     FLEXCAN_IFLAG1_BUF31TO8I_MASK)
/*! @} */

/*! @name CTRL2 - Control 2 Register */
/*! @{ */

#define FLEXCAN_CTRL2_EDFLTDIS_MASK (0x800U)
#define FLEXCAN_CTRL2_EDFLTDIS_SHIFT (11U)
#define FLEXCAN_CTRL2_EDFLTDIS_WIDTH (1U)
#define FLEXCAN_CTRL2_EDFLTDIS(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_EDFLTDIS_SHIFT)) & FLEXCAN_CTRL2_EDFLTDIS_MASK)

#define FLEXCAN_CTRL2_ISOCANFDEN_MASK (0x1000U)
#define FLEXCAN_CTRL2_ISOCANFDEN_SHIFT (12U)
#define FLEXCAN_CTRL2_ISOCANFDEN_WIDTH (1U)
#define FLEXCAN_CTRL2_ISOCANFDEN(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_ISOCANFDEN_SHIFT)) &                             \
     FLEXCAN_CTRL2_ISOCANFDEN_MASK)

#define FLEXCAN_CTRL2_PREXCEN_MASK (0x4000U)
#define FLEXCAN_CTRL2_PREXCEN_SHIFT (14U)
#define FLEXCAN_CTRL2_PREXCEN_WIDTH (1U)
#define FLEXCAN_CTRL2_PREXCEN(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_PREXCEN_SHIFT)) & FLEXCAN_CTRL2_PREXCEN_MASK)

#define FLEXCAN_CTRL2_TIMER_SRC_MASK (0x8000U)
#define FLEXCAN_CTRL2_TIMER_SRC_SHIFT (15U)
#define FLEXCAN_CTRL2_TIMER_SRC_WIDTH (1U)
#define FLEXCAN_CTRL2_TIMER_SRC(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_TIMER_SRC_SHIFT)) & FLEXCAN_CTRL2_TIMER_SRC_MASK)

#define FLEXCAN_CTRL2_EACEN_MASK (0x10000U)
#define FLEXCAN_CTRL2_EACEN_SHIFT (16U)
#define FLEXCAN_CTRL2_EACEN_WIDTH (1U)
#define FLEXCAN_CTRL2_EACEN(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_EACEN_SHIFT)) & FLEXCAN_CTRL2_EACEN_MASK)

#define FLEXCAN_CTRL2_RRS_MASK (0x20000U)
#define FLEXCAN_CTRL2_RRS_SHIFT (17U)
#define FLEXCAN_CTRL2_RRS_WIDTH (1U)
#define FLEXCAN_CTRL2_RRS(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_RRS_SHIFT)) & FLEXCAN_CTRL2_RRS_MASK)

