rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
#define FLEXCAN_CTRL2_MRP_MASK (0x40000U)
#define FLEXCAN_CTRL2_MRP_SHIFT (18U)
#define FLEXCAN_CTRL2_MRP_WIDTH (1U)
#define FLEXCAN_CTRL2_MRP(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_MRP_SHIFT)) & FLEXCAN_CTRL2_MRP_MASK)

#define FLEXCAN_CTRL2_TASD_MASK (0xF80000U)
#define FLEXCAN_CTRL2_TASD_SHIFT (19U)
#define FLEXCAN_CTRL2_TASD_WIDTH (5U)
#define FLEXCAN_CTRL2_TASD(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_TASD_SHIFT)) & FLEXCAN_CTRL2_TASD_MASK)

#define FLEXCAN_CTRL2_RFFN_MASK (0xF000000U)
#define FLEXCAN_CTRL2_RFFN_SHIFT (24U)
#define FLEXCAN_CTRL2_RFFN_WIDTH (4U)
#define FLEXCAN_CTRL2_RFFN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_RFFN_SHIFT)) & FLEXCAN_CTRL2_RFFN_MASK)

#define FLEXCAN_CTRL2_BOFFDONEMSK_MASK (0x40000000U)
#define FLEXCAN_CTRL2_BOFFDONEMSK_SHIFT (30U)
#define FLEXCAN_CTRL2_BOFFDONEMSK_WIDTH (1U)
#define FLEXCAN_CTRL2_BOFFDONEMSK(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_BOFFDONEMSK_SHIFT)) &                            \
     FLEXCAN_CTRL2_BOFFDONEMSK_MASK)

#define FLEXCAN_CTRL2_ERRMSK_FAST_MASK (0x80000000U)
#define FLEXCAN_CTRL2_ERRMSK_FAST_SHIFT (31U)
#define FLEXCAN_CTRL2_ERRMSK_FAST_WIDTH (1U)
#define FLEXCAN_CTRL2_ERRMSK_FAST(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_ERRMSK_FAST_SHIFT)) &                            \
     FLEXCAN_CTRL2_ERRMSK_FAST_MASK)
/*! @} */

/*! @name ESR2 - Error and Status 2 Register */
/*! @{ */

#define FLEXCAN_ESR2_IMB_MASK (0x2000U)
#define FLEXCAN_ESR2_IMB_SHIFT (13U)
#define FLEXCAN_ESR2_IMB_WIDTH (1U)
#define FLEXCAN_ESR2_IMB(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR2_IMB_SHIFT)) & FLEXCAN_ESR2_IMB_MASK)

#define FLEXCAN_ESR2_VPS_MASK (0x4000U)
#define FLEXCAN_ESR2_VPS_SHIFT (14U)
#define FLEXCAN_ESR2_VPS_WIDTH (1U)
#define FLEXCAN_ESR2_VPS(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR2_VPS_SHIFT)) & FLEXCAN_ESR2_VPS_MASK)

#define FLEXCAN_ESR2_LPTM_MASK (0x7F0000U)
#define FLEXCAN_ESR2_LPTM_SHIFT (16U)
#define FLEXCAN_ESR2_LPTM_WIDTH (7U)
#define FLEXCAN_ESR2_LPTM(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR2_LPTM_SHIFT)) & FLEXCAN_ESR2_LPTM_MASK)
/*! @} */

/*! @name CRCR - CRC Register */
/*! @{ */

#define FLEXCAN_CRCR_TXCRC_MASK (0x7FFFU)
#define FLEXCAN_CRCR_TXCRC_SHIFT (0U)
#define FLEXCAN_CRCR_TXCRC_WIDTH (15U)
#define FLEXCAN_CRCR_TXCRC(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CRCR_TXCRC_SHIFT)) & FLEXCAN_CRCR_TXCRC_MASK)

#define FLEXCAN_CRCR_MBCRC_MASK (0x7F0000U)
#define FLEXCAN_CRCR_MBCRC_SHIFT (16U)
#define FLEXCAN_CRCR_MBCRC_WIDTH (7U)
#define FLEXCAN_CRCR_MBCRC(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CRCR_MBCRC_SHIFT)) & FLEXCAN_CRCR_MBCRC_MASK)
/*! @} */

/*! @name RXFGMASK - Rx FIFO Global Mask Register */
/*! @{ */

#define FLEXCAN_RXFGMASK_FGM_MASK (0xFFFFFFFFU)
#define FLEXCAN_RXFGMASK_FGM_SHIFT (0U)
#define FLEXCAN_RXFGMASK_FGM_WIDTH (32U)
#define FLEXCAN_RXFGMASK_FGM(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RXFGMASK_FGM_SHIFT)) & FLEXCAN_RXFGMASK_FGM_MASK)
/*! @} */

/*! @name RXFIR - Rx FIFO Information Register */
/*! @{ */

#define FLEXCAN_RXFIR_IDHIT_MASK (0x1FFU)
#define FLEXCAN_RXFIR_IDHIT_SHIFT (0U)
#define FLEXCAN_RXFIR_IDHIT_WIDTH (9U)
#define FLEXCAN_RXFIR_IDHIT(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RXFIR_IDHIT_SHIFT)) & FLEXCAN_RXFIR_IDHIT_MASK)
/*! @} */

/*! @name CBT - CAN Bit Timing Register */
/*! @{ */

#define FLEXCAN_CBT_EPSEG2_MASK (0x1FU)
#define FLEXCAN_CBT_EPSEG2_SHIFT (0U)
#define FLEXCAN_CBT_EPSEG2_WIDTH (5U)
#define FLEXCAN_CBT_EPSEG2(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_EPSEG2_SHIFT)) & FLEXCAN_CBT_EPSEG2_MASK)

#define FLEXCAN_CBT_EPSEG1_MASK (0x3E0U)
#define FLEXCAN_CBT_EPSEG1_SHIFT (5U)
#define FLEXCAN_CBT_EPSEG1_WIDTH (5U)
#define FLEXCAN_CBT_EPSEG1(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_EPSEG1_SHIFT)) & FLEXCAN_CBT_EPSEG1_MASK)

#define FLEXCAN_CBT_EPROPSEG_MASK (0xFC00U)
#define FLEXCAN_CBT_EPROPSEG_SHIFT (10U)
#define FLEXCAN_CBT_EPROPSEG_WIDTH (6U)
#define FLEXCAN_CBT_EPROPSEG(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_EPROPSEG_SHIFT)) & FLEXCAN_CBT_EPROPSEG_MASK)

#define FLEXCAN_CBT_ERJW_MASK (0x1F0000U)
#define FLEXCAN_CBT_ERJW_SHIFT (16U)
#define FLEXCAN_CBT_ERJW_WIDTH (5U)
#define FLEXCAN_CBT_ERJW(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_ERJW_SHIFT)) & FLEXCAN_CBT_ERJW_MASK)

#define FLEXCAN_CBT_EPRESDIV_MASK (0x7FE00000U)
#define FLEXCAN_CBT_EPRESDIV_SHIFT (21U)
#define FLEXCAN_CBT_EPRESDIV_WIDTH (10U)
#define FLEXCAN_CBT_EPRESDIV(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_EPRESDIV_SHIFT)) & FLEXCAN_CBT_EPRESDIV_MASK)

#define FLEXCAN_CBT_BTF_MASK (0x80000000U)
#define FLEXCAN_CBT_BTF_SHIFT (31U)
#define FLEXCAN_CBT_BTF_WIDTH (1U)
#define FLEXCAN_CBT_BTF(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CBT_BTF_SHIFT)) & FLEXCAN_CBT_BTF_MASK)
/*! @} */

/*! @name RAMn - Embedded RAM */
/*! @{ */

#define FLEXCAN_RAMn_DATA_BYTE_3_MASK (0xFFU)
#define FLEXCAN_RAMn_DATA_BYTE_3_SHIFT (0U)
#define FLEXCAN_RAMn_DATA_BYTE_3_WIDTH (8U)
#define FLEXCAN_RAMn_DATA_BYTE_3(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RAMn_DATA_BYTE_3_SHIFT)) &                             \
     FLEXCAN_RAMn_DATA_BYTE_3_MASK)

