rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
#define FLEXCAN_RAMn_DATA_BYTE_2_MASK (0xFF00U)
#define FLEXCAN_RAMn_DATA_BYTE_2_SHIFT (8U)
#define FLEXCAN_RAMn_DATA_BYTE_2_WIDTH (8U)
#define FLEXCAN_RAMn_DATA_BYTE_2(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RAMn_DATA_BYTE_2_SHIFT)) &                             \
     FLEXCAN_RAMn_DATA_BYTE_2_MASK)

#define FLEXCAN_RAMn_DATA_BYTE_1_MASK (0xFF0000U)
#define FLEXCAN_RAMn_DATA_BYTE_1_SHIFT (16U)
#define FLEXCAN_RAMn_DATA_BYTE_1_WIDTH (8U)
#define FLEXCAN_RAMn_DATA_BYTE_1(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RAMn_DATA_BYTE_1_SHIFT)) &                             \
     FLEXCAN_RAMn_DATA_BYTE_1_MASK)

#define FLEXCAN_RAMn_DATA_BYTE_0_MASK (0xFF000000U)
#define FLEXCAN_RAMn_DATA_BYTE_0_SHIFT (24U)
#define FLEXCAN_RAMn_DATA_BYTE_0_WIDTH (8U)
#define FLEXCAN_RAMn_DATA_BYTE_0(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RAMn_DATA_BYTE_0_SHIFT)) &                             \
     FLEXCAN_RAMn_DATA_BYTE_0_MASK)
/*! @} */

/*! @name RXIMR - Rx Individual Mask Registers */
/*! @{ */

#define FLEXCAN_RXIMR_MI_MASK (0xFFFFFFFFU)
#define FLEXCAN_RXIMR_MI_SHIFT (0U)
#define FLEXCAN_RXIMR_MI_WIDTH (32U)
#define FLEXCAN_RXIMR_MI(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RXIMR_MI_SHIFT)) & FLEXCAN_RXIMR_MI_MASK)
/*! @} */

/*! @name CTRL1_PN - Pretended Networking Control 1 Register */
/*! @{ */

#define FLEXCAN_CTRL1_PN_FCS_MASK (0x3U)
#define FLEXCAN_CTRL1_PN_FCS_SHIFT (0U)
#define FLEXCAN_CTRL1_PN_FCS_WIDTH (2U)
#define FLEXCAN_CTRL1_PN_FCS(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PN_FCS_SHIFT)) & FLEXCAN_CTRL1_PN_FCS_MASK)

#define FLEXCAN_CTRL1_PN_IDFS_MASK (0xCU)
#define FLEXCAN_CTRL1_PN_IDFS_SHIFT (2U)
#define FLEXCAN_CTRL1_PN_IDFS_WIDTH (2U)
#define FLEXCAN_CTRL1_PN_IDFS(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PN_IDFS_SHIFT)) & FLEXCAN_CTRL1_PN_IDFS_MASK)

#define FLEXCAN_CTRL1_PN_PLFS_MASK (0x30U)
#define FLEXCAN_CTRL1_PN_PLFS_SHIFT (4U)
#define FLEXCAN_CTRL1_PN_PLFS_WIDTH (2U)
#define FLEXCAN_CTRL1_PN_PLFS(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PN_PLFS_SHIFT)) & FLEXCAN_CTRL1_PN_PLFS_MASK)

#define FLEXCAN_CTRL1_PN_NMATCH_MASK (0xFF00U)
#define FLEXCAN_CTRL1_PN_NMATCH_SHIFT (8U)
#define FLEXCAN_CTRL1_PN_NMATCH_WIDTH (8U)
#define FLEXCAN_CTRL1_PN_NMATCH(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PN_NMATCH_SHIFT)) & FLEXCAN_CTRL1_PN_NMATCH_MASK)

#define FLEXCAN_CTRL1_PN_WUMF_MSK_MASK (0x10000U)
#define FLEXCAN_CTRL1_PN_WUMF_MSK_SHIFT (16U)
#define FLEXCAN_CTRL1_PN_WUMF_MSK_WIDTH (1U)
#define FLEXCAN_CTRL1_PN_WUMF_MSK(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PN_WUMF_MSK_SHIFT)) &                            \
     FLEXCAN_CTRL1_PN_WUMF_MSK_MASK)

#define FLEXCAN_CTRL1_PN_WTOF_MSK_MASK (0x20000U)
#define FLEXCAN_CTRL1_PN_WTOF_MSK_SHIFT (17U)
#define FLEXCAN_CTRL1_PN_WTOF_MSK_WIDTH (1U)
#define FLEXCAN_CTRL1_PN_WTOF_MSK(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PN_WTOF_MSK_SHIFT)) &                            \
     FLEXCAN_CTRL1_PN_WTOF_MSK_MASK)
/*! @} */

/*! @name CTRL2_PN - Pretended Networking Control 2 Register */
/*! @{ */

#define FLEXCAN_CTRL2_PN_MATCHTO_MASK (0xFFFFU)
#define FLEXCAN_CTRL2_PN_MATCHTO_SHIFT (0U)
#define FLEXCAN_CTRL2_PN_MATCHTO_WIDTH (16U)
#define FLEXCAN_CTRL2_PN_MATCHTO(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL2_PN_MATCHTO_SHIFT)) &                             \
     FLEXCAN_CTRL2_PN_MATCHTO_MASK)
/*! @} */

/*! @name WU_MTC - Pretended Networking Wake Up Match Register */
/*! @{ */

#define FLEXCAN_WU_MTC_MCOUNTER_MASK (0xFF00U)
#define FLEXCAN_WU_MTC_MCOUNTER_SHIFT (8U)
#define FLEXCAN_WU_MTC_MCOUNTER_WIDTH (8U)
#define FLEXCAN_WU_MTC_MCOUNTER(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WU_MTC_MCOUNTER_SHIFT)) & FLEXCAN_WU_MTC_MCOUNTER_MASK)

#define FLEXCAN_WU_MTC_WUMF_MASK (0x10000U)
#define FLEXCAN_WU_MTC_WUMF_SHIFT (16U)
#define FLEXCAN_WU_MTC_WUMF_WIDTH (1U)
#define FLEXCAN_WU_MTC_WUMF(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WU_MTC_WUMF_SHIFT)) & FLEXCAN_WU_MTC_WUMF_MASK)

#define FLEXCAN_WU_MTC_WTOF_MASK (0x20000U)
#define FLEXCAN_WU_MTC_WTOF_SHIFT (17U)
#define FLEXCAN_WU_MTC_WTOF_WIDTH (1U)
#define FLEXCAN_WU_MTC_WTOF(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WU_MTC_WTOF_SHIFT)) & FLEXCAN_WU_MTC_WTOF_MASK)
/*! @} */

/*! @name FLT_ID1 - Pretended Networking ID Filter 1 Register */
/*! @{ */

#define FLEXCAN_FLT_ID1_FLT_ID1_MASK (0x1FFFFFFFU)
#define FLEXCAN_FLT_ID1_FLT_ID1_SHIFT (0U)
#define FLEXCAN_FLT_ID1_FLT_ID1_WIDTH (29U)
#define FLEXCAN_FLT_ID1_FLT_ID1(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FLT_ID1_FLT_ID1_SHIFT)) & FLEXCAN_FLT_ID1_FLT_ID1_MASK)

#define FLEXCAN_FLT_ID1_FLT_RTR_MASK (0x20000000U)
#define FLEXCAN_FLT_ID1_FLT_RTR_SHIFT (29U)
#define FLEXCAN_FLT_ID1_FLT_RTR_WIDTH (1U)
#define FLEXCAN_FLT_ID1_FLT_RTR(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FLT_ID1_FLT_RTR_SHIFT)) & FLEXCAN_FLT_ID1_FLT_RTR_MASK)

#define FLEXCAN_FLT_ID1_FLT_IDE_MASK (0x40000000U)
#define FLEXCAN_FLT_ID1_FLT_IDE_SHIFT (30U)
#define FLEXCAN_FLT_ID1_FLT_IDE_WIDTH (1U)
#define FLEXCAN_FLT_ID1_FLT_IDE(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FLT_ID1_FLT_IDE_SHIFT)) & FLEXCAN_FLT_ID1_FLT_IDE_MASK)
/*! @} */

/*! @name FLT_DLC - Pretended Networking DLC Filter Register */
/*! @{ */

