rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
#define FLEXCAN_FLT_DLC_FLT_DLC_HI_MASK (0xFU)
#define FLEXCAN_FLT_DLC_FLT_DLC_HI_SHIFT (0U)
#define FLEXCAN_FLT_DLC_FLT_DLC_HI_WIDTH (4U)
#define FLEXCAN_FLT_DLC_FLT_DLC_HI(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FLT_DLC_FLT_DLC_HI_SHIFT)) &                           \
     FLEXCAN_FLT_DLC_FLT_DLC_HI_MASK)

#define FLEXCAN_FLT_DLC_FLT_DLC_LO_MASK (0xF0000U)
#define FLEXCAN_FLT_DLC_FLT_DLC_LO_SHIFT (16U)
#define FLEXCAN_FLT_DLC_FLT_DLC_LO_WIDTH (4U)
#define FLEXCAN_FLT_DLC_FLT_DLC_LO(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FLT_DLC_FLT_DLC_LO_SHIFT)) &                           \
     FLEXCAN_FLT_DLC_FLT_DLC_LO_MASK)
/*! @} */

/*! @name PL1_LO - Pretended Networking Payload Low Filter 1 Register */
/*! @{ */

#define FLEXCAN_PL1_LO_Data_byte_3_MASK (0xFFU)
#define FLEXCAN_PL1_LO_Data_byte_3_SHIFT (0U)
#define FLEXCAN_PL1_LO_Data_byte_3_WIDTH (8U)
#define FLEXCAN_PL1_LO_Data_byte_3(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL1_LO_Data_byte_3_SHIFT)) &                           \
     FLEXCAN_PL1_LO_Data_byte_3_MASK)

#define FLEXCAN_PL1_LO_Data_byte_2_MASK (0xFF00U)
#define FLEXCAN_PL1_LO_Data_byte_2_SHIFT (8U)
#define FLEXCAN_PL1_LO_Data_byte_2_WIDTH (8U)
#define FLEXCAN_PL1_LO_Data_byte_2(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL1_LO_Data_byte_2_SHIFT)) &                           \
     FLEXCAN_PL1_LO_Data_byte_2_MASK)

#define FLEXCAN_PL1_LO_Data_byte_1_MASK (0xFF0000U)
#define FLEXCAN_PL1_LO_Data_byte_1_SHIFT (16U)
#define FLEXCAN_PL1_LO_Data_byte_1_WIDTH (8U)
#define FLEXCAN_PL1_LO_Data_byte_1(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL1_LO_Data_byte_1_SHIFT)) &                           \
     FLEXCAN_PL1_LO_Data_byte_1_MASK)

#define FLEXCAN_PL1_LO_Data_byte_0_MASK (0xFF000000U)
#define FLEXCAN_PL1_LO_Data_byte_0_SHIFT (24U)
#define FLEXCAN_PL1_LO_Data_byte_0_WIDTH (8U)
#define FLEXCAN_PL1_LO_Data_byte_0(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL1_LO_Data_byte_0_SHIFT)) &                           \
     FLEXCAN_PL1_LO_Data_byte_0_MASK)
/*! @} */

/*! @name PL1_HI - Pretended Networking Payload High Filter 1 Register */
/*! @{ */

#define FLEXCAN_PL1_HI_Data_byte_7_MASK (0xFFU)
#define FLEXCAN_PL1_HI_Data_byte_7_SHIFT (0U)
#define FLEXCAN_PL1_HI_Data_byte_7_WIDTH (8U)
#define FLEXCAN_PL1_HI_Data_byte_7(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL1_HI_Data_byte_7_SHIFT)) &                           \
     FLEXCAN_PL1_HI_Data_byte_7_MASK)

#define FLEXCAN_PL1_HI_Data_byte_6_MASK (0xFF00U)
#define FLEXCAN_PL1_HI_Data_byte_6_SHIFT (8U)
#define FLEXCAN_PL1_HI_Data_byte_6_WIDTH (8U)
#define FLEXCAN_PL1_HI_Data_byte_6(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL1_HI_Data_byte_6_SHIFT)) &                           \
     FLEXCAN_PL1_HI_Data_byte_6_MASK)

#define FLEXCAN_PL1_HI_Data_byte_5_MASK (0xFF0000U)
#define FLEXCAN_PL1_HI_Data_byte_5_SHIFT (16U)
#define FLEXCAN_PL1_HI_Data_byte_5_WIDTH (8U)
#define FLEXCAN_PL1_HI_Data_byte_5(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL1_HI_Data_byte_5_SHIFT)) &                           \
     FLEXCAN_PL1_HI_Data_byte_5_MASK)

#define FLEXCAN_PL1_HI_Data_byte_4_MASK (0xFF000000U)
#define FLEXCAN_PL1_HI_Data_byte_4_SHIFT (24U)
#define FLEXCAN_PL1_HI_Data_byte_4_WIDTH (8U)
#define FLEXCAN_PL1_HI_Data_byte_4(x)                                                              \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL1_HI_Data_byte_4_SHIFT)) &                           \
     FLEXCAN_PL1_HI_Data_byte_4_MASK)
/*! @} */

/*! @name FLT_ID2_IDMASK - Pretended Networking ID Filter 2 Register / ID Mask Register */
/*! @{ */

#define FLEXCAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_MASK (0x1FFFFFFFU)
#define FLEXCAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_SHIFT (0U)
#define FLEXCAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_WIDTH (29U)
#define FLEXCAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK(x)                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_SHIFT)) &                \
     FLEXCAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_MASK)

#define FLEXCAN_FLT_ID2_IDMASK_RTR_MSK_MASK (0x20000000U)
#define FLEXCAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT (29U)
#define FLEXCAN_FLT_ID2_IDMASK_RTR_MSK_WIDTH (1U)
#define FLEXCAN_FLT_ID2_IDMASK_RTR_MSK(x)                                                          \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT)) &                       \
     FLEXCAN_FLT_ID2_IDMASK_RTR_MSK_MASK)

#define FLEXCAN_FLT_ID2_IDMASK_IDE_MSK_MASK (0x40000000U)
#define FLEXCAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT (30U)
#define FLEXCAN_FLT_ID2_IDMASK_IDE_MSK_WIDTH (1U)
#define FLEXCAN_FLT_ID2_IDMASK_IDE_MSK(x)                                                          \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT)) &                       \
     FLEXCAN_FLT_ID2_IDMASK_IDE_MSK_MASK)
/*! @} */

/*! @name PL2_PLMASK_LO - Pretended Networking Payload Low Filter 2 Register / Payload Low Mask
 * register */
/*! @{ */

#define FLEXCAN_PL2_PLMASK_LO_Data_byte_3_MASK (0xFFU)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_3_SHIFT (0U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_3_WIDTH (8U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_3(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL2_PLMASK_LO_Data_byte_3_SHIFT)) &                    \
     FLEXCAN_PL2_PLMASK_LO_Data_byte_3_MASK)

#define FLEXCAN_PL2_PLMASK_LO_Data_byte_2_MASK (0xFF00U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_2_SHIFT (8U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_2_WIDTH (8U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_2(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL2_PLMASK_LO_Data_byte_2_SHIFT)) &                    \
     FLEXCAN_PL2_PLMASK_LO_Data_byte_2_MASK)

#define FLEXCAN_PL2_PLMASK_LO_Data_byte_1_MASK (0xFF0000U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_1_SHIFT (16U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_1_WIDTH (8U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_1(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL2_PLMASK_LO_Data_byte_1_SHIFT)) &                    \
     FLEXCAN_PL2_PLMASK_LO_Data_byte_1_MASK)

