rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_0_MASK (0xFF000000U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_0_SHIFT (24U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_0_WIDTH (8U)
#define FLEXCAN_PL2_PLMASK_LO_Data_byte_0(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL2_PLMASK_LO_Data_byte_0_SHIFT)) &                    \
     FLEXCAN_PL2_PLMASK_LO_Data_byte_0_MASK)
/*! @} */

/*! @name PL2_PLMASK_HI - Pretended Networking Payload High Filter 2 low order bits / Payload High
 * Mask register */
/*! @{ */

#define FLEXCAN_PL2_PLMASK_HI_Data_byte_7_MASK (0xFFU)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_7_SHIFT (0U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_7_WIDTH (8U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_7(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL2_PLMASK_HI_Data_byte_7_SHIFT)) &                    \
     FLEXCAN_PL2_PLMASK_HI_Data_byte_7_MASK)

#define FLEXCAN_PL2_PLMASK_HI_Data_byte_6_MASK (0xFF00U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_6_SHIFT (8U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_6_WIDTH (8U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_6(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL2_PLMASK_HI_Data_byte_6_SHIFT)) &                    \
     FLEXCAN_PL2_PLMASK_HI_Data_byte_6_MASK)

#define FLEXCAN_PL2_PLMASK_HI_Data_byte_5_MASK (0xFF0000U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_5_SHIFT (16U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_5_WIDTH (8U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_5(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL2_PLMASK_HI_Data_byte_5_SHIFT)) &                    \
     FLEXCAN_PL2_PLMASK_HI_Data_byte_5_MASK)

#define FLEXCAN_PL2_PLMASK_HI_Data_byte_4_MASK (0xFF000000U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_4_SHIFT (24U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_4_WIDTH (8U)
#define FLEXCAN_PL2_PLMASK_HI_Data_byte_4(x)                                                       \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_PL2_PLMASK_HI_Data_byte_4_SHIFT)) &                    \
     FLEXCAN_PL2_PLMASK_HI_Data_byte_4_MASK)
/*! @} */

/*! @name WMBn_CS - Wake Up Message Buffer register for C/S */
/*! @{ */

#define FLEXCAN_WMBn_CS_DLC_MASK (0xF0000U)
#define FLEXCAN_WMBn_CS_DLC_SHIFT (16U)
#define FLEXCAN_WMBn_CS_DLC_WIDTH (4U)
#define FLEXCAN_WMBn_CS_DLC(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_CS_DLC_SHIFT)) & FLEXCAN_WMBn_CS_DLC_MASK)

#define FLEXCAN_WMBn_CS_RTR_MASK (0x100000U)
#define FLEXCAN_WMBn_CS_RTR_SHIFT (20U)
#define FLEXCAN_WMBn_CS_RTR_WIDTH (1U)
#define FLEXCAN_WMBn_CS_RTR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_CS_RTR_SHIFT)) & FLEXCAN_WMBn_CS_RTR_MASK)

#define FLEXCAN_WMBn_CS_IDE_MASK (0x200000U)
#define FLEXCAN_WMBn_CS_IDE_SHIFT (21U)
#define FLEXCAN_WMBn_CS_IDE_WIDTH (1U)
#define FLEXCAN_WMBn_CS_IDE(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_CS_IDE_SHIFT)) & FLEXCAN_WMBn_CS_IDE_MASK)

#define FLEXCAN_WMBn_CS_SRR_MASK (0x400000U)
#define FLEXCAN_WMBn_CS_SRR_SHIFT (22U)
#define FLEXCAN_WMBn_CS_SRR_WIDTH (1U)
#define FLEXCAN_WMBn_CS_SRR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_CS_SRR_SHIFT)) & FLEXCAN_WMBn_CS_SRR_MASK)
/*! @} */

/*! @name WMBn_ID - Wake Up Message Buffer Register for ID */
/*! @{ */

#define FLEXCAN_WMBn_ID_ID_MASK (0x1FFFFFFFU)
#define FLEXCAN_WMBn_ID_ID_SHIFT (0U)
#define FLEXCAN_WMBn_ID_ID_WIDTH (29U)
#define FLEXCAN_WMBn_ID_ID(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_ID_ID_SHIFT)) & FLEXCAN_WMBn_ID_ID_MASK)
/*! @} */

/*! @name WMBn_D03 - Wake Up Message Buffer Register for Data 0-3 */
/*! @{ */

#define FLEXCAN_WMBn_D03_Data_byte_3_MASK (0xFFU)
#define FLEXCAN_WMBn_D03_Data_byte_3_SHIFT (0U)
#define FLEXCAN_WMBn_D03_Data_byte_3_WIDTH (8U)
#define FLEXCAN_WMBn_D03_Data_byte_3(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_D03_Data_byte_3_SHIFT)) &                         \
     FLEXCAN_WMBn_D03_Data_byte_3_MASK)

#define FLEXCAN_WMBn_D03_Data_byte_2_MASK (0xFF00U)
#define FLEXCAN_WMBn_D03_Data_byte_2_SHIFT (8U)
#define FLEXCAN_WMBn_D03_Data_byte_2_WIDTH (8U)
#define FLEXCAN_WMBn_D03_Data_byte_2(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_D03_Data_byte_2_SHIFT)) &                         \
     FLEXCAN_WMBn_D03_Data_byte_2_MASK)

#define FLEXCAN_WMBn_D03_Data_byte_1_MASK (0xFF0000U)
#define FLEXCAN_WMBn_D03_Data_byte_1_SHIFT (16U)
#define FLEXCAN_WMBn_D03_Data_byte_1_WIDTH (8U)
#define FLEXCAN_WMBn_D03_Data_byte_1(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_D03_Data_byte_1_SHIFT)) &                         \
     FLEXCAN_WMBn_D03_Data_byte_1_MASK)

#define FLEXCAN_WMBn_D03_Data_byte_0_MASK (0xFF000000U)
#define FLEXCAN_WMBn_D03_Data_byte_0_SHIFT (24U)
#define FLEXCAN_WMBn_D03_Data_byte_0_WIDTH (8U)
#define FLEXCAN_WMBn_D03_Data_byte_0(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_D03_Data_byte_0_SHIFT)) &                         \
     FLEXCAN_WMBn_D03_Data_byte_0_MASK)
/*! @} */

/*! @name WMBn_D47 - Wake Up Message Buffer Register Data 4-7 */
/*! @{ */

#define FLEXCAN_WMBn_D47_Data_byte_7_MASK (0xFFU)
#define FLEXCAN_WMBn_D47_Data_byte_7_SHIFT (0U)
#define FLEXCAN_WMBn_D47_Data_byte_7_WIDTH (8U)
#define FLEXCAN_WMBn_D47_Data_byte_7(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_D47_Data_byte_7_SHIFT)) &                         \
     FLEXCAN_WMBn_D47_Data_byte_7_MASK)

#define FLEXCAN_WMBn_D47_Data_byte_6_MASK (0xFF00U)
#define FLEXCAN_WMBn_D47_Data_byte_6_SHIFT (8U)
#define FLEXCAN_WMBn_D47_Data_byte_6_WIDTH (8U)
#define FLEXCAN_WMBn_D47_Data_byte_6(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_D47_Data_byte_6_SHIFT)) &                         \
     FLEXCAN_WMBn_D47_Data_byte_6_MASK)

#define FLEXCAN_WMBn_D47_Data_byte_5_MASK (0xFF0000U)
#define FLEXCAN_WMBn_D47_Data_byte_5_SHIFT (16U)
#define FLEXCAN_WMBn_D47_Data_byte_5_WIDTH (8U)
#define FLEXCAN_WMBn_D47_Data_byte_5(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_D47_Data_byte_5_SHIFT)) &                         \
     FLEXCAN_WMBn_D47_Data_byte_5_MASK)

