rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_FLEXCAN.h
#define FLEXCAN_WMBn_D47_Data_byte_4_MASK (0xFF000000U)
#define FLEXCAN_WMBn_D47_Data_byte_4_SHIFT (24U)
#define FLEXCAN_WMBn_D47_Data_byte_4_WIDTH (8U)
#define FLEXCAN_WMBn_D47_Data_byte_4(x)                                                            \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WMBn_D47_Data_byte_4_SHIFT)) &                         \
     FLEXCAN_WMBn_D47_Data_byte_4_MASK)
/*! @} */

/*! @name FDCTRL - CAN FD Control Register */
/*! @{ */

#define FLEXCAN_FDCTRL_TDCVAL_MASK (0x3FU)
#define FLEXCAN_FDCTRL_TDCVAL_SHIFT (0U)
#define FLEXCAN_FDCTRL_TDCVAL_WIDTH (6U)
#define FLEXCAN_FDCTRL_TDCVAL(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_TDCVAL_SHIFT)) & FLEXCAN_FDCTRL_TDCVAL_MASK)

#define FLEXCAN_FDCTRL_TDCOFF_MASK (0x1F00U)
#define FLEXCAN_FDCTRL_TDCOFF_SHIFT (8U)
#define FLEXCAN_FDCTRL_TDCOFF_WIDTH (5U)
#define FLEXCAN_FDCTRL_TDCOFF(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_TDCOFF_SHIFT)) & FLEXCAN_FDCTRL_TDCOFF_MASK)

#define FLEXCAN_FDCTRL_TDCFAIL_MASK (0x4000U)
#define FLEXCAN_FDCTRL_TDCFAIL_SHIFT (14U)
#define FLEXCAN_FDCTRL_TDCFAIL_WIDTH (1U)
#define FLEXCAN_FDCTRL_TDCFAIL(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_TDCFAIL_SHIFT)) & FLEXCAN_FDCTRL_TDCFAIL_MASK)

#define FLEXCAN_FDCTRL_TDCEN_MASK (0x8000U)
#define FLEXCAN_FDCTRL_TDCEN_SHIFT (15U)
#define FLEXCAN_FDCTRL_TDCEN_WIDTH (1U)
#define FLEXCAN_FDCTRL_TDCEN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_TDCEN_SHIFT)) & FLEXCAN_FDCTRL_TDCEN_MASK)

#define FLEXCAN_FDCTRL_MBDSR0_MASK (0x30000U)
#define FLEXCAN_FDCTRL_MBDSR0_SHIFT (16U)
#define FLEXCAN_FDCTRL_MBDSR0_WIDTH (2U)
#define FLEXCAN_FDCTRL_MBDSR0(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_MBDSR0_SHIFT)) & FLEXCAN_FDCTRL_MBDSR0_MASK)

#define FLEXCAN_FDCTRL_MBDSR1_MASK (0x180000U)
#define FLEXCAN_FDCTRL_MBDSR1_SHIFT (19U)
#define FLEXCAN_FDCTRL_MBDSR1_WIDTH (2U)
#define FLEXCAN_FDCTRL_MBDSR1(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_MBDSR1_SHIFT)) & FLEXCAN_FDCTRL_MBDSR1_MASK)

#define FLEXCAN_FDCTRL_FDRATE_MASK (0x80000000U)
#define FLEXCAN_FDCTRL_FDRATE_SHIFT (31U)
#define FLEXCAN_FDCTRL_FDRATE_WIDTH (1U)
#define FLEXCAN_FDCTRL_FDRATE(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_FDRATE_SHIFT)) & FLEXCAN_FDCTRL_FDRATE_MASK)
/*! @} */

/*! @name FDCBT - CAN FD Bit Timing Register */
/*! @{ */

#define FLEXCAN_FDCBT_FPSEG2_MASK (0x7U)
#define FLEXCAN_FDCBT_FPSEG2_SHIFT (0U)
#define FLEXCAN_FDCBT_FPSEG2_WIDTH (3U)
#define FLEXCAN_FDCBT_FPSEG2(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FPSEG2_SHIFT)) & FLEXCAN_FDCBT_FPSEG2_MASK)

#define FLEXCAN_FDCBT_FPSEG1_MASK (0xE0U)
#define FLEXCAN_FDCBT_FPSEG1_SHIFT (5U)
#define FLEXCAN_FDCBT_FPSEG1_WIDTH (3U)
#define FLEXCAN_FDCBT_FPSEG1(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FPSEG1_SHIFT)) & FLEXCAN_FDCBT_FPSEG1_MASK)

#define FLEXCAN_FDCBT_FPROPSEG_MASK (0x7C00U)
#define FLEXCAN_FDCBT_FPROPSEG_SHIFT (10U)
#define FLEXCAN_FDCBT_FPROPSEG_WIDTH (5U)
#define FLEXCAN_FDCBT_FPROPSEG(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FPROPSEG_SHIFT)) & FLEXCAN_FDCBT_FPROPSEG_MASK)

#define FLEXCAN_FDCBT_FRJW_MASK (0x70000U)
#define FLEXCAN_FDCBT_FRJW_SHIFT (16U)
#define FLEXCAN_FDCBT_FRJW_WIDTH (3U)
#define FLEXCAN_FDCBT_FRJW(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FRJW_SHIFT)) & FLEXCAN_FDCBT_FRJW_MASK)

#define FLEXCAN_FDCBT_FPRESDIV_MASK (0x3FF00000U)
#define FLEXCAN_FDCBT_FPRESDIV_SHIFT (20U)
#define FLEXCAN_FDCBT_FPRESDIV_WIDTH (10U)
#define FLEXCAN_FDCBT_FPRESDIV(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FPRESDIV_SHIFT)) & FLEXCAN_FDCBT_FPRESDIV_MASK)
/*! @} */

/*! @name FDCRC - CAN FD CRC Register */
/*! @{ */

#define FLEXCAN_FDCRC_FD_TXCRC_MASK (0x1FFFFFU)
#define FLEXCAN_FDCRC_FD_TXCRC_SHIFT (0U)
#define FLEXCAN_FDCRC_FD_TXCRC_WIDTH (21U)
#define FLEXCAN_FDCRC_FD_TXCRC(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCRC_FD_TXCRC_SHIFT)) & FLEXCAN_FDCRC_FD_TXCRC_MASK)

#define FLEXCAN_FDCRC_FD_MBCRC_MASK (0x7F000000U)
#define FLEXCAN_FDCRC_FD_MBCRC_SHIFT (24U)
#define FLEXCAN_FDCRC_FD_MBCRC_WIDTH (7U)
#define FLEXCAN_FDCRC_FD_MBCRC(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCRC_FD_MBCRC_SHIFT)) & FLEXCAN_FDCRC_FD_MBCRC_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group FLEXCAN_Register_Masks */

/*!
 * @}
 */ /* end of group FLEXCAN_Peripheral_Access_Layer */

#endif /* #if !defined(S32M24x_FLEXCAN_H_) */
